# IsViewerModeActive Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..IsViewerModeActive Property
UIApplication Class See Also
---
Determines if Revit session is in Viewer mode.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public bool IsViewerModeActive { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsViewerModeActive As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsViewerModeActive {
	bool get ();
}
```

# See Also
UIApplication Class
Autodesk.Revit.UI Namespace